# List of Packages

## Essentials
base
base-devel
linux
linux-firmware

## Misc Term Utilities
neovim
git
stow
fzf
curl
wget
gnupg
openssh

## Shells & Emulators
fish
xonsh
>python-prompt_toolkit
*st
alacritty

## Documentation
man-db
man-pages
texinfo

## X Display Server
xorg
xorg-drivers
xorg-xinit
brightnessctl
xclip

## Window Manager & Co
bspwm
sxhkd
picom
nitrogen
physlock

## Network
networkmanager

## Audio
pipewire
pipewire-pulse
pipewire-alsa
wireplumber
pamixer
pavucontrol

## Bluetooth
bluez-utils
blueman

## Launchers/Notifiers
rofi
dmenu
dunst

## Browser
firefox-developer-edition

## File Managers & Co
nnn
>trash-cli
>*tabbed
>xdotool
broot
thunar

## Media Openers/Manipulators
mpv
sxiv
gimp
ffmpeg
flameshot
imagemagick

## Book Reader
zathura
zathura-pdf-mupdf
zathura-djvu

## System Information
tint2
>pacman-contrib
>gsimplecal
btop
conky
neofetch

## Torrent
transmission-cli

## Fonts
ttf-fira-code
ttf-dejavu
noto-fonts
ttf-unifont
gnu-free-fonts
ttf-liberation
wqy-zenhei
otf-font-awesome

## Themes
materia-gtk-theme
