# List of Packages

## Essentials
base
base-devel
linux
linux-firmware

## Misc Term Utilities
neovim
git
stow
fzf
bat
curl
wget
gnupg
openssh
ripgrep
fd

## Shells & Emulators
fish
xonsh
>python-prompt_toolkit
*afro-st
alacritty
ghostty
foot

## Documentation
man-db
man-pages
texinfo

## X Display Server
xorg
xorg-drivers
xorg-xinit

## WM/Compositor & Co
bspwm
sxhkd
picom
tint2
>pacman-contrib
>gsimplecal
nitrogen
flameshot
xclip

hyprland
waybar
swaybg
grim
slurp
wl-clipboard

physlock
brightnessctl
copyq

## Network
networkmanager

## Audio
pipewire
pipewire-pulse
pipewire-alsa
wireplumber
pamixer
pavucontrol

## Bluetooth
bluez-utils
blueman

## Launchers/Notifiers
rofi
dmenu
fuzzel
dunst

## Browsers
firefox-developer-edition
chromium

## File Managers & Co
nnn
>trash-cli
broot
yazi

## Media Openers/Manipulators
mpv
nsxiv
gimp
krita
inkscape
ffmpeg
imagemagick

## Book Reader
zathura
zathura-pdf-poppler
zathura-djvu

## System Information
btop
conky
fastfetch

## Torrent
transmission-cli

## Fonts
ttf-firacode-nerd
ttf-jetbrains-mono-nerd
otf-font-awesome
ttf-dejavu
noto-fonts
noto-fonts-emoji
ttf-unifont
gnu-free-fonts
ttf-liberation
wqy-zenhei

## Themes
materia-gtk-theme
