# List of Packages

## Essentials
base
base-devel
linux
linux-firmware

## Misc Term Utilities
neovim
git
stow
fzf
curl
wget
openssh

## Shells & Emulators
fish
xonsh
>python-prompt_toolkit
>python-pygments
*st
termite

## Documentation
man-db
man-pages
texinfo

## Xorg Groups
xorg
xorg-drivers

## Window Manager & Co
bspwm
sxhkd
picom
nitrogen
xlockmore

## Network
networkmanager
*networkmanager_dmenu

## Audio
pulseaudio
pulseaudio-alsa
pulseaudio-bluetooth
pamixer
pavucontrol

## Bluetooth
bluez-utils
blueman

## Launchers/Notifiers
rofi
dmenu
dunst

## Browser
firefox-developer-edition

## File Managers & Co
nnn
>*tabbed
>xdotool
broot
thunar

## Media Openers/Manipulators
mpv
sxiv
gimp
scrot
ffmpeg
imagemagick
ghostscript

## Book Reader
zathura
zathura-pdf-mupdf
zathura-djvu

## System Information
*polybar
htop
neofetch

## Torrent
transmission-cli

## Fonts
ttf-fira-code
ttf-dejavu
noto-fonts
bdf-unifont
gnu-free-fonts
ttf-liberation
wqy-zenhei
*siji.pcf

## Themes
materia-gtk-theme
